import requests
import re

# URL по которому расположен HTML-файл:
html_page_url = 'http://www.mediacollege.com/internet/html/image-tag.html'

server_response = requests.get(html_page_url)  # загрузка HTML-файла.
low_case_html = server_response.text.lower()  # перевод HTML-кода в нижний регистр, чтобы было проще искать.

# Поиск всех графических изображений с расширениями .jpg, .gif, .png:
all_img = re.findall(r"<img.*? src=\"(.+?(\.jpg|\.gif|\.png))\".*?>", low_case_html)
# В HTML вставка изображения делается следующим образом:
#  <img src="URL" alt="альтернативный текст">
# Соответственно нужно написать шаблон под который бы подходили все такие теги: r"<img.*? src=\"(.+?)\".*?>"
#   r""    - обозначает "сырую" строку (в таких строках подавляется экранирование).
#   <img   - строка должна начинаться с данной последовательности символов.
#   .*?    - дальше могут идти любые символы, т.е. какие-нибудь параметры вроде alt.
#   src=\" - дальше встречаем параметр указывающий путь к изображению.
#
#   (.+?(\.jpg|\.gif|\.png)) - URL может содержать любые символы, но должен оканчиваться на .jpg, .gif или .png.
#
#   \"     - закрывающая кавычка для значения параметра src.
#   .*?    - дальше могут идти другие параметры тега img, т.е. другие символы.
#   >      - закрывающая скобка тега img.

for img in all_img:
    print(img[0])
